SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_smu.h
/* Bit fields for SMU ESAUMRB45 */
#define _SMU_ESAUMRB45_RESETVALUE               0x02000000UL                            /**< Default value for SMU_ESAUMRB45             */
#define _SMU_ESAUMRB45_MASK                     0x0FFFF000UL                            /**< Mask for SMU_ESAUMRB45                      */
#define _SMU_ESAUMRB45_ESAUMRB45_SHIFT          12                                      /**< Shift value for SMU_ESAUMRB45               */
#define _SMU_ESAUMRB45_ESAUMRB45_MASK           0xFFFF000UL                             /**< Bit mask for SMU_ESAUMRB45                  */
#define _SMU_ESAUMRB45_ESAUMRB45_DEFAULT        0x00002000UL                            /**< Mode DEFAULT for SMU_ESAUMRB45              */
#define SMU_ESAUMRB45_ESAUMRB45_DEFAULT         (_SMU_ESAUMRB45_ESAUMRB45_DEFAULT << 12) /**< Shifted mode DEFAULT for SMU_ESAUMRB45      */

/* Bit fields for SMU ESAUMRB56 */
#define _SMU_ESAUMRB56_RESETVALUE               0x04000000UL                            /**< Default value for SMU_ESAUMRB56             */
#define _SMU_ESAUMRB56_MASK                     0x0FFFF000UL                            /**< Mask for SMU_ESAUMRB56                      */
#define _SMU_ESAUMRB56_ESAUMRB56_SHIFT          12                                      /**< Shift value for SMU_ESAUMRB56               */
#define _SMU_ESAUMRB56_ESAUMRB56_MASK           0xFFFF000UL                             /**< Bit mask for SMU_ESAUMRB56                  */
#define _SMU_ESAUMRB56_ESAUMRB56_DEFAULT        0x00004000UL                            /**< Mode DEFAULT for SMU_ESAUMRB56              */
#define SMU_ESAUMRB56_ESAUMRB56_DEFAULT         (_SMU_ESAUMRB56_ESAUMRB56_DEFAULT << 12) /**< Shifted mode DEFAULT for SMU_ESAUMRB56      */

/** @} End of group EFR32SG23_SMU_BitFields */
/** @} End of group EFR32SG23_SMU */
/**************************************************************************//**
 * @defgroup EFR32SG23_SMU_CFGNS SMU_CFGNS
 * @{
 * @brief EFR32SG23 SMU_CFGNS Register Declaration.
 *****************************************************************************/

/** SMU_CFGNS Register Declaration. */
typedef struct
{
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             NSSTATUS;               /**< Status Register                                    */
  __IOM uint32_t             NSLOCK;                 /**< Lock Register                                      */
  __IOM uint32_t             NSIF;                   /**< Interrupt Flag Register                            */
  __IOM uint32_t             NSIEN;                  /**< Interrupt Enable Register                          */
        uint32_t             RESERVED1[3U];          /**< Reserved for future use                            */
        uint32_t             RESERVED2[8U];     /**< Reserved for future use                            */
  __IOM uint32_t             PPUNSPATD0;             /**< Privileged Access                                  */
  __IOM uint32_t             PPUNSPATD1;             /**< Privileged Access                                  */
        uint32_t             RESERVED3[62U];         /**< Reserved for future use                            */
  __IM  uint32_t             PPUNSFS;                /**< Fault Status                                       */
        uint32_t             RESERVED4[3U];     /**< Reserved for future use                            */
  __IOM uint32_t             BMPUNSPATD0;            /**< Privileged Attribute                               */
        uint32_t             RESERVED5[63U];         /**< Reserved for future use                            */
        uint32_t             RESERVED6[876U];   /**< Reserved for future use                            */
        uint32_t             RESERVED7[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             NSSTATUS_SET;           /**< Status Register                                    */
  __IOM uint32_t             NSLOCK_SET;             /**< Lock Register                                      */
  __IOM uint32_t             NSIF_SET;               /**< Interrupt Flag Register                            */
  __IOM uint32_t             NSIEN_SET;              /**< Interrupt Enable Register                          */
        uint32_t             RESERVED8[3U];          /**< Reserved for future use                            */
        uint32_t             RESERVED9[8U];     /**< Reserved for future use                            */
  __IOM uint32_t             PPUNSPATD0_SET;         /**< Privileged Access                                  */
  __IOM uint32_t             PPUNSPATD1_SET;         /**< Privileged Access                                  */
        uint32_t             RESERVED10[62U];        /**< Reserved for future use                            */
  __IM  uint32_t             PPUNSFS_SET;            /**< Fault Status                                       */
        uint32_t             RESERVED11[3U];    /**< Reserved for future use                            */
  __IOM uint32_t             BMPUNSPATD0_SET;        /**< Privileged Attribute                               */
        uint32_t             RESERVED12[63U];        /**< Reserved for future use                            */
        uint32_t             RESERVED13[876U];  /**< Reserved for future use                            */
        uint32_t             RESERVED14[1U];         /**< Reserved for future use                            */
  __IM  uint32_t             NSSTATUS_CLR;           /**< Status Register                                    */
  __IOM uint32_t             NSLOCK_CLR;             /**< Lock Register                                      */
  __IOM uint32_t             NSIF_CLR;               /**< Interrupt Flag Register                            */
  __IOM uint32_t             NSIEN_CLR;              /**< Interrupt Enable Register                          */
        uint32_t             RESERVED15[3U];         /**< Reserved for future use                            */
        uint32_t             RESERVED16[8U];    /**< Reserved for future use                            */
  __IOM uint32_t             PPUNSPATD0_CLR;         /**< Privileged Access                                  */
  __IOM uint32_t             PPUNSPATD1_CLR;         /**< Privileged Access                                  */
        uint32_t             RESERVED17[62U];        /**< Reserved for future use                            */
  __IM  uint32_t             PPUNSFS_CLR;            /**< Fault Status                                       */
        uint32_t             RESERVED18[3U];    /**< Reserved for future use                            */
  __IOM uint32_t             BMPUNSPATD0_CLR;        /**< Privileged Attribute                               */
        uint32_t             RESERVED19[63U];        /**< Reserved for future use                            */
        uint32_t             RESERVED20[876U];  /**< Reserved for future use                            */
        uint32_t             RESERVED21[1U];         /**< Reserved for future use                            */
  __IM  uint32_t             NSSTATUS_TGL;           /**< Status Register                                    */
  __IOM uint32_t             NSLOCK_TGL;             /**< Lock Register                                      */
  __IOM uint32_t             NSIF_TGL;               /**< Interrupt Flag Register                            */
  __IOM uint32_t             NSIEN_TGL;              /**< Interrupt Enable Register                          */
        uint32_t             RESERVED22[3U];         /**< Reserved for future use                            */
        uint32_t             RESERVED23[8U];    /**< Reserved for future use                            */
  __IOM uint32_t             PPUNSPATD0_TGL;         /**< Privileged Access                                  */
  __IOM uint32_t             PPUNSPATD1_TGL;         /**< Privileged Access                                  */
        uint32_t             RESERVED24[62U];        /**< Reserved for future use                            */
  __IM  uint32_t             PPUNSFS_TGL;            /**< Fault Status                                       */
        uint32_t             RESERVED25[3U];    /**< Reserved for future use                            */
  __IOM uint32_t             BMPUNSPATD0_TGL;        /**< Privileged Attribute                               */
        uint32_t             RESERVED26[63U];        /**< Reserved for future use                            */
} SMU_CFGNS_TypeDef;
/** @} End of group EFR32SG23_SMU_CFGNS */

/**************************************************************************//**
 * @addtogroup EFR32SG23_SMU_CFGNS
 * @{
 * @defgroup EFR32SG23_SMU_CFGNS_BitFields SMU_CFGNS Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for SMU NSSTATUS */
#define _SMU_NSSTATUS_RESETVALUE                0x00000000UL                            /**< Default value for SMU_NSSTATUS              */
#define _SMU_NSSTATUS_MASK                      0x00000001UL                            /**< Mask for SMU_NSSTATUS                       */
#define SMU_NSSTATUS_SMUNSLOCK                  (0x1UL << 0)                            /**< SMUNS Lock                                  */
#define _SMU_NSSTATUS_SMUNSLOCK_SHIFT           0                                       /**< Shift value for SMU_SMUNSLOCK               */
#define _SMU_NSSTATUS_SMUNSLOCK_MASK            0x1UL                                   /**< Bit mask for SMU_SMUNSLOCK                  */
#define _SMU_NSSTATUS_SMUNSLOCK_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for SMU_NSSTATUS               */
#define _SMU_NSSTATUS_SMUNSLOCK_UNLOCKED        0x00000000UL                            /**< Mode UNLOCKED for SMU_NSSTATUS              */
#define _SMU_NSSTATUS_SMUNSLOCK_LOCKED          0x00000001UL                            /**< Mode LOCKED for SMU_NSSTATUS                */
#define SMU_NSSTATUS_SMUNSLOCK_DEFAULT          (_SMU_NSSTATUS_SMUNSLOCK_DEFAULT << 0)  /**< Shifted mode DEFAULT for SMU_NSSTATUS       */
#define SMU_NSSTATUS_SMUNSLOCK_UNLOCKED         (_SMU_NSSTATUS_SMUNSLOCK_UNLOCKED << 0) /**< Shifted mode UNLOCKED for SMU_NSSTATUS      */
#define SMU_NSSTATUS_SMUNSLOCK_LOCKED           (_SMU_NSSTATUS_SMUNSLOCK_LOCKED << 0)   /**< Shifted mode LOCKED for SMU_NSSTATUS        */

/* Bit fields for SMU NSLOCK */
#define _SMU_NSLOCK_RESETVALUE                  0x00000000UL                            /**< Default value for SMU_NSLOCK                */
#define _SMU_NSLOCK_MASK                        0x00FFFFFFUL                            /**< Mask for SMU_NSLOCK                         */
#define _SMU_NSLOCK_SMUNSLOCKKEY_SHIFT          0                                       /**< Shift value for SMU_SMUNSLOCKKEY            */
#define _SMU_NSLOCK_SMUNSLOCKKEY_MASK           0xFFFFFFUL                              /**< Bit mask for SMU_SMUNSLOCKKEY               */
#define _SMU_NSLOCK_SMUNSLOCKKEY_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for SMU_NSLOCK                 */
#define _SMU_NSLOCK_SMUNSLOCKKEY_UNLOCK         0x00ACCE55UL                            /**< Mode UNLOCK for SMU_NSLOCK                  */
#define SMU_NSLOCK_SMUNSLOCKKEY_DEFAULT         (_SMU_NSLOCK_SMUNSLOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for SMU_NSLOCK         */
#define SMU_NSLOCK_SMUNSLOCKKEY_UNLOCK          (_SMU_NSLOCK_SMUNSLOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for SMU_NSLOCK          */

/* Bit fields for SMU NSIF */
#define _SMU_NSIF_RESETVALUE                    0x00000000UL                            /**< Default value for SMU_NSIF                  */
#define _SMU_NSIF_MASK                          0x00000005UL                            /**< Mask for SMU_NSIF                           */
#define SMU_NSIF_PPUNSPRIV                      (0x1UL << 0)                            /**< PPUNS Privilege Interrupt Flag              */
#define _SMU_NSIF_PPUNSPRIV_SHIFT               0                                       /**< Shift value for SMU_PPUNSPRIV               */
#define _SMU_NSIF_PPUNSPRIV_MASK                0x1UL                                   /**< Bit mask for SMU_PPUNSPRIV                  */
#define _SMU_NSIF_PPUNSPRIV_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for SMU_NSIF                   */
#define SMU_NSIF_PPUNSPRIV_DEFAULT              (_SMU_NSIF_PPUNSPRIV_DEFAULT << 0)      /**< Shifted mode DEFAULT for SMU_NSIF           */
#define SMU_NSIF_PPUNSINST                      (0x1UL << 2)                            /**< PPUNS Instruction Interrupt Flag            */
#define _SMU_NSIF_PPUNSINST_SHIFT               2                                       /**< Shift value for SMU_PPUNSINST               */
#define _SMU_NSIF_PPUNSINST_MASK                0x4UL                                   /**< Bit mask for SMU_PPUNSINST                  */
#define _SMU_NSIF_PPUNSINST_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for SMU_NSIF                   */
#define SMU_NSIF_PPUNSINST_DEFAULT              (_SMU_NSIF_PPUNSINST_DEFAULT << 2)      /**< Shifted mode DEFAULT for SMU_NSIF           */

/* Bit fields for SMU NSIEN */
#define _SMU_NSIEN_RESETVALUE                   0x00000000UL                            /**< Default value for SMU_NSIEN                 */
#define _SMU_NSIEN_MASK                         0x00000005UL                            /**< Mask for SMU_NSIEN                          */
#define SMU_NSIEN_PPUNSPRIV                     (0x1UL << 0)                            /**< PPUNS Privilege Interrupt Enable            */
#define _SMU_NSIEN_PPUNSPRIV_SHIFT              0                                       /**< Shift value for SMU_PPUNSPRIV               */
#define _SMU_NSIEN_PPUNSPRIV_MASK               0x1UL                                   /**< Bit mask for SMU_PPUNSPRIV                  */
#define _SMU_NSIEN_PPUNSPRIV_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMU_NSIEN                  */
#define SMU_NSIEN_PPUNSPRIV_DEFAULT             (_SMU_NSIEN_PPUNSPRIV_DEFAULT << 0)     /**< Shifted mode DEFAULT for SMU_NSIEN          */
#define SMU_NSIEN_PPUNSINST                     (0x1UL << 2)                            /**< PPUNS Instruction Interrupt Enable          */
#define _SMU_NSIEN_PPUNSINST_SHIFT              2                                       /**< Shift value for SMU_PPUNSINST               */
#define _SMU_NSIEN_PPUNSINST_MASK               0x4UL                                   /**< Bit mask for SMU_PPUNSINST                  */
#define _SMU_NSIEN_PPUNSINST_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMU_NSIEN                  */
#define SMU_NSIEN_PPUNSINST_DEFAULT             (_SMU_NSIEN_PPUNSINST_DEFAULT << 2)     /**< Shifted mode DEFAULT for SMU_NSIEN          */

